In [1]:
import pandas as pd
import numpy as np

## What is Pandas?

- Pandas is short form for Panel Data (Panel - Pan & Data - da) with an extra "s"
- Library for Data Analysis and Wrangling.
- Series and DataFrame are the building blocks of Pandas

## Series And DataFrame:
- Series : Data stored in one column
- DataFrame: Data stored in a table with many rows and many columns.

In [2]:
ser = pd.Series([10, 20, 25, 50, 75, 100])
ser

0     10
1     20
2     25
3     50
4     75
5    100
dtype: int64

In [3]:
type(ser)

pandas.core.series.Series

In [5]:
ser1 = pd.Series([10, 20, 30, 25, 50, 100], index = ['a', 'b', 'c', 'd', 'e', 'f'])
ser1

a     10
b     20
c     30
d     25
e     50
f    100
dtype: int64

In [7]:
ser1['d']

25

In [8]:
dic = {
    'a' : [10, 20, 30, 40, 50, 100],
    'b' : [1, 2, 3, 4, 5, 6],
    'c' : ['a', 'b', 'c', 'd', 'e', 'f']
}
dic

{'a': [10, 20, 30, 40, 50, 100],
 'b': [1, 2, 3, 4, 5, 6],
 'c': ['a', 'b', 'c', 'd', 'e', 'f']}

In [10]:
df = pd.DataFrame(dic)
df

     a  b  c
0   10  1  a
1   20  2  b
2   30  3  c
3   40  4  d
4   50  5  e
5  100  6  f

In [11]:
dic = {
    'Name' : ['Anesha', 'Arya', 'Ajit', 'Kumar', 'Santosh'],
    'Age' : [34, 57, 28, 45, 40],
    'Gender' : ['Female', 'Female', 'Male', "Male", 'Male'],
    'Salary' : [56000, 97000, 23000, 45000, 42000]
 }
dic

{'Name': ['Anesha', 'Arya', 'Ajit', 'Kumar', 'Santosh'],
 'Age': [34, 57, 28, 45, 40],
 'Gender': ['Female', 'Female', 'Male', 'Male', 'Male'],
 'Salary': [56000, 97000, 23000, 45000, 42000]}

In [12]:
df1 = pd.DataFrame(dic)
df1

      Name  Age  Gender  Salary
0   Anesha   34  Female   56000
1     Arya   57  Female   97000
2     Ajit   28    Male   23000
3    Kumar   45    Male   45000
4  Santosh   40    Male   42000

In [13]:
type(df1)

pandas.core.frame.DataFrame

## Can Series have multiple data types?

In [14]:
l1 = [10, 20.5, 'Anil']
l1

[10, 20.5, 'Anil']

In [15]:
pd.Series(l1)

0      10
1    20.5
2    Anil
dtype: object

- Series allows to enter multiple data type values but the entire series will have only one data type i.e object

## I want to connect to a file (Load an excel file in jupyter notebook)

In [18]:
### Loading the sample_data.csv file to jupyter notebook
## Because the file is a csv file hence use read_csv()
data = pd.read_csv("Sample data.csv", names = ['name', 'age', 'salary', 'gender'])
data

    name  age  salary gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [24]:
## Loading an excel file 
## to load an excel file we have to use read_excel()
data1 = pd.read_excel('Sample data.xlsx', names = ['name', 'age', 'salary', 'gender'])
data1

    name  age  salary gender
0  Sunil   24   35000      M
1  Ashok   26   45000      M
2  Seema   28   55000      F
3  Reema   30   65000      F

Assignment : Why did we loose the details of Anil?

In [26]:
## Load a tsv file : tab seperated values

data2 = pd.read_csv('sample-data.tsv', sep = "\t")
data2

,FID,AFFGEOID,TRACTCE,ST,STATE,ST_ABBR,STCNTY,COUNTY,FIPS,LOCATION,...,F_CROWD,F_NOVEH,F_GROUPQ,F_THEME4,F_TOTAL,E_UNINSUR,M_UNINSUR,EP_UNINSUR,MP_UNINSUR,E_DAYPOP
0,-1,1400000US36065023400,23400,36,New York,NY,36065,Oneida,36065023400,"Census Tract 234, Oneida County, New York",...,0,0,1,1,2,154,125,3.6,2.9,10017
1,-1,1400000US36065023501,23501,36,New York,NY,36065,Oneida,36065023501,"Census Tract 235.01, Oneida County, New York",...,0,0,0,0,1,151,100,6.3,4.2,912
2,-1,1400000US36065023502,23502,36,New York,NY,36065,Oneida,36065023502,"Census Tract 235.02, Oneida County, New York",...,0,0,0,0,0,131,85,2.9,1.8,3057
3,-1,1400000US36065023702,23702,36,New York,NY,36065,Oneida,36065023702,"Census Tract 237.02, Oneida County, New York",...,0,0,0,0,0,385,136,10.2,3.6,1407
4,-1,1400000US36065023901,23901,36,New York,NY,36065,Oneida,36065023901,"Census Tract 239.01, Oneida County, New York",...,0,0,0,0,0,165,97,7.2,4.3,1646
5,-1,1400000US36065023902,23902,36,New York,NY,36065,Oneida,36065023902,"Census Tract 239.02, Oneida County, New York",...,0,0,0,0,0,155,77,7.8,3.8,873
6,-1,1400000US36065024000,24000,36,New York,NY,36065,Oneida,36065024000,"Census Tract 240, Oneida County, New York",...,0,0,0,0,0,169,85,3.8,1.9,4696
7,-1,1400000US36065024101,24101,36,New York,NY,36065,Oneida,36065024101,"Census Tract 241.01, Oneida County, New York",...,0,0,0,0,2,93,38,6.3,2.5,921

In [29]:
## When reading a file you encounter "File Not Found Error" , To get rid of this error you have to mention
## the file name along with file location

data3 = pd.read_csv(r"C:\Users\AMANT\Downloads\USA_cars_datasets.csv")
data3

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,3,25000,ford,door,2014,clean vehicle,64146.0,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2494,2494,7800,nissan,versa,2019,clean vehicle,23609.0,red,3n1cn7ap9kl880319,167722715,california,usa,1 days left
2495,2495,9200,nissan,versa,2018,clean vehicle,34553.0,silver,3n1cn7ap5jl884088,167762225,florida,usa,21 hours left
2496,2496,9200,nissan,versa,2018,clean vehicle,31594.0,silver,3n1cn7ap9jl884191,167762226,florida,usa,21 hours left
2497,2497,9200,nissan,versa,2018,clean vehicle,32557.0,black,3n1cn7ap3jl883263,167762227,florida,usa,2 days left
2498,2498,9200,nissan,versa,2018,clean vehicle,31371.0,silver,3n1cn7ap4jl884311,167762228,florida,usa,21 hours left

In [30]:
data

    name  age  salary gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

## Select and Display only name in the output

In [31]:
data["name"]

0     Anil
1    Sunil
2    Ashok
3    Seema
4    Reema
Name: name, dtype: object

In [32]:
## Select and display only Salary

data["salary"]

0    25000
1    35000
2    45000
3    55000
4    65000
Name: salary, dtype: int64

### Note: From a DataFrame when only one columns is selected and displayed in the output then the output is a series

In [33]:
data

    name  age  salary gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [34]:
cols = ["name", "salary"]
data[cols]

    name  salary
0   Anil   25000
1  Sunil   35000
2  Ashok   45000
3  Seema   55000
4  Reema   65000

In [35]:
data[["name", "salary"]]

    name  salary
0   Anil   25000
1  Sunil   35000
2  Ashok   45000
3  Seema   55000
4  Reema   65000

## Attributes for a DataFrame

In [36]:
data

    name  age  salary gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [43]:
type(data)

pandas.core.frame.DataFrame

In [37]:
data.shape

(5, 4)

In [38]:
data.ndim

2

In [39]:
## Display only the column names of the data

data.columns

Index(['name', 'age', 'salary', 'gender'], dtype='object')

In [41]:
## getting the data types of all the column present in the data

data.dtypes

name      object
age        int64
salary     int64
gender    object
dtype: object

## Functions

In [42]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   salary  5 non-null      int64
 3   gender  5 non-null      object
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [45]:
dic = {
    'Name' : ['Anesha', 'Arya', 'Ajit', 'Kumar', 'Santosh'],
    'Age' : [34, 57, 28, np.nan, 40],
    'Gender' : ['Female', 'Female', 'Male', "Male", 'Male'],
    'Salary' : [56000, np.nan, 23000, 45000, np.nan]
 }
dic

{'Name': ['Anesha', 'Arya', 'Ajit', 'Kumar', 'Santosh'],
 'Age': [34, 57, 28, nan, 40],
 'Gender': ['Female', 'Female', 'Male', 'Male', 'Male'],
 'Salary': [56000, nan, 23000, 45000, nan]}

In [47]:
df = pd.DataFrame(dic)
df

      Name   Age  Gender   Salary
0   Anesha  34.0  Female  56000.0
1     Arya  57.0  Female      NaN
2     Ajit  28.0    Male  23000.0
3    Kumar   NaN    Male  45000.0
4  Santosh  40.0    Male      NaN

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     4 non-null      float64
 2   Gender  5 non-null      object
 3   Salary  3 non-null      float64
dtypes: float64(2), object(2)
memory usage: 288.0+ bytes

In [49]:
data

    name  age  salary gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

## Arithematic functions on the data

In [51]:
## Calc the total salary of all 5 employees

data["salary"].sum()

225000

In [52]:
## Cal the avg salary of all 5 employees

data["salary"].mean()

45000.0

In [53]:
## calc median salary of all 5 employees

data["salary"].median()

45000.0

In [55]:
## Display how many employees are working

data["salary"].count()

5

In [57]:
data["salary"].min()

25000

In [58]:
data["salary"].max()

65000

In [56]:
data["salary"].describe()

count        5.000000
mean     45000.000000
std      15811.388301
min      25000.000000
25%      35000.000000
50%      45000.000000
75%      55000.000000
max      65000.000000
Name: salary, dtype: float64

- 50% is also called as the median of the data
- describe() display the summary statistics of the data(like mean, min, max, etc..)

In [59]:
data.describe()

             age        salary
count   5.000000      5.000000
mean   26.000000  45000.000000
std     3.162278  15811.388301
min    22.000000  25000.000000
25%    24.000000  35000.000000
50%    26.000000  45000.000000
75%    28.000000  55000.000000
max    30.000000  65000.000000

In [60]:
data

    name  age  salary gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

## value_counts() function:

In [61]:
data['gender'].value_counts()

M    3
F    2
Name: gender, dtype: int64

In [62]:
## To get the % of males and female employees working

data['gender'].value_counts(normalize = True) * 100

M    60.0
F    40.0
Name: gender, dtype: float64

In [63]:
data['gender'].describe()

count     5
unique    2
top       M
freq      3
Name: gender, dtype: object

In [64]:
data['name'].describe()

count        5
unique       5
top       Anil
freq         1
Name: name, dtype: object

In [66]:
data.describe(include = "O")

        name gender
count      5      5
unique     5      2
top     Anil      M
freq       1      3

In [67]:
data.describe(include = "all")

        name        age        salary gender
count      5   5.000000      5.000000      5
unique     5        NaN           NaN      2
top     Anil        NaN           NaN      M
freq       1        NaN           NaN      3
mean     NaN  26.000000  45000.000000    NaN
std      NaN   3.162278  15811.388301    NaN
min      NaN  22.000000  25000.000000    NaN
25%      NaN  24.000000  35000.000000    NaN
50%      NaN  26.000000  45000.000000    NaN
75%      NaN  28.000000  55000.000000    NaN
max      NaN  30.000000  65000.000000    NaN